#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
google_compute_network.default: Refreshing state... [id=projects/sandbox-364517/global/networks/tf-network-demo]
google_compute_subnetwork.public_1: Refreshing state... [id=projects/sandbox-364517/regions/us-central1/subnetworks/tf-subnet-public-1]
google_compute_subnetwork.public_2: Refreshing state... [id=projects/sandbox-364517/regions/us-central1/subnetworks/tf-subnet-public-2]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # google_compute_subnetwork.public_2 must be replaced
-/+ resource "google_compute_subnetwork" "public_2" {
      ~ creation_timestamp         = "2022-10-27T10:57:44.664-07:00" -> (known after apply)
      + description                = "Subnet publica" # forces replacement
      + external_ipv6_prefix       = (known after apply)
      + fingerprint                = (known after apply)
      ~ gateway_address            = "10.125.16.1" -> (known after apply)
      ~ id                         = "projects/sandbox-364517/regions/us-central1/subnetworks/tf-subnet-public-2" -> (known after apply)
      + ipv6_cidr_range            = (known after apply)
        name                       = "tf-subnet-public-2"
      ~ network                    = "https://www.googleapis.com/compute/v1/projects/sandbox-364517/global/networks/tf-network-demo" -> "tf-network-demo"
      - private_ip_google_access   = false -> null
      ~ private_ipv6_google_access = "DISABLE_GOOGLE_ACCESS" -> (known after apply)
      ~ project                    = "sandbox-364517" -> (known after apply)
      ~ purpose                    = "PRIVATE" -> (known after apply)
      ~ secondary_ip_range         = [] -> (known after apply)
      ~ self_link                  = "https://www.googleapis.com/compute/v1/projects/sandbox-364517/regions/us-central1/subnetworks/tf-subnet-public-2" -> (known after apply)
      ~ stack_type                 = "IPV4_ONLY" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @carlosrv999, Action: `pull_request`*